
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 19.5
___/   /   /___/   /   /___/       SE—Standard Edition

 Statistics and Data Science       Copyright 1985-2025 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user network, expiring 31 Jul 2026
Serial number: 401909304042
  Licensed to: Collin Jay Wardius
               UC San Diego

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000 but can be increased; see
          help set_maxvar.

. do clean19161918.do 

. 
. cd "/Users/cjwardius/Library/CloudStorage/OneDrive-UCSanDiego/demo of education"
/Users/cjwardius/Library/CloudStorage/OneDrive-UCSanDiego/demo of education

. import delimited "data/extracted_scans/bi_survey1916_1918_extracted", clear
(encoding automatically selected: UTF-8)
(25 vars, 6,048 obs)

. rename v1 page_number 

. rename v2 header_indicator 

. 
. * generated header inicator works well for these data
. keep if inrange(page, 1, 111)
(1,532 observations deleted)

. 
. 
. 
. * assign states to colleges. state names typically have associated periods.
. 
. g is_state = !missing(v3) & missing(v4)

. 
. g state = substr(v3, 1, strpos(v3, "-") - 1) if is_state & strpos(v3, "-")>0
(4,470 missing values generated)

. replace state = v3 if is_state & strpos(v3, "-")==0
variable state was str14 now str24
(50 real changes made)

. replace state = subinstr(state, ".","",.)
(51 real changes made)

. replace state = upper(state)
(2 real changes made)

. replace state = "NORTH CAROLINA" if state=="NORTH CARO"
(0 real changes made)

. replace state = "DISTRICT OF COLUMBIA" if state=="DISTRICT OF CO"
(0 real changes made)

. replace state = "MASSACHUSETTS" if state=="MASSACHUSETTS CONTINUED"
(1 real change made)

. 
. * fill states
. 
. replace state = state[_n-1] if missing(state) 
(4,417 real changes made)

. drop if is_state
(96 observations deleted)

. 
. * drop headers now that the states are filled.
. 
. drop if header_indicator==1
(273 observations deleted)

. 
. * fill town
. 
. replace v3 = "" if inlist(v3, "Do", "Do (May", "Do.")
(180 real changes made)

. replace v3 = v3[_n-1] if missing(v3)
(3,698 real changes made)

. 
. 
. * fill university
. 
. g lower_cat = lower(v4)
(1 missing value generated)

. g is_college = strpos(lower_cat, "col") > 0 ///
>     | strpos(lower_cat, "inst") > 0 ///
>     | strpos(lower_cat, "uni") > 0

. 
. g college = lower_cat if is_college
(3,596 missing values generated)

. replace college = college[_n-1] if missing(college)
(3,596 real changes made)

. 
. * drop anything in parentheses
. 
. replace college = substr(college,1,strpos(college, "(")-1) if strpos(college, "(
> ")>0
(99 real changes made)

. 
. * create a category row 
. 
. g category = "total" if is_college
(3,596 missing values generated)

. replace category = "major" if is_college ==0
(3,596 real changes made)

. 
. 
. * create header row
. 
. rename v3 town

. rename v4 program

. rename v5 for_men_women

. rename v6 control

. rename v7 year_first_opening

. rename v8 professors_men

. rename v9 professors_women

. rename v10 total_professors_men

. rename v11 total_professors_women

. rename v12 students_men

. rename v13 students_women

. rename v14 total_students_men

. rename v15 total_students_women

. rename v16 first_degrees_men

. rename v17 first_degrees_women

. rename v18 total_first_degrees_men

. rename v19 total_first_degrees_women

. rename v20 graduate_degrees_men

. rename v21 graduate_degrees_women

. rename v22 total_graduate_degrees_men

. rename v23 total_graduate_degrees_women

. rename v24 honorary_degrees

. 
. 
. 
. * keep a subset of the variables
. 
. keep state town college program category for_men_women control year_first_openin
> g professors_men professors_women total_professors_men total_professors_women st
> udents_men students_women total_students_men total_students_women first_degrees_
> men first_degrees_women total_first_degrees_men total_first_degrees_women gradua
> te_degrees_men graduate_degrees_women total_graduate_degrees_men total_graduate_
> degrees_women honorary_degrees is_college

. 
. order state town college program category for_men_women control year_first_openi
> ng professors_men professors_women total_professors_men total_professors_women s
> tudents_men students_women total_students_men total_students_women first_degrees
> _men first_degrees_women total_first_degrees_men total_first_degrees_women gradu
> ate_degrees_men graduate_degrees_women total_graduate_degrees_men total_graduate
> _degrees_women honorary_degrees is_college

. 
. * replace so that total is consolidated for the leading college row
. 
. replace professors_men = total_professors_men if is_college
(537 real changes made)

. replace professors_women = total_professors_women if is_college
(534 real changes made)

. replace students_men = total_students_men if is_college
(541 real changes made)

. replace students_women = total_students_women if is_college
(540 real changes made)

. replace first_degrees_men = total_first_degrees_men if is_college
(495 real changes made)

. replace first_degrees_women = total_first_degrees_women if is_college
(494 real changes made)

. replace graduate_degrees_men = total_graduate_degrees_men if is_college
(208 real changes made)

. replace graduate_degrees_women = total_graduate_degrees_women if is_college
(207 real changes made)

. 
. 
. drop total_professors_men

. drop total_professors_women

. drop total_students_men

. drop total_students_women

. drop total_first_degrees_men

. drop total_first_degrees_women

. drop total_graduate_degrees_men

. drop total_graduate_degrees_women

. 
. * clean college names - remove non-conventional characters including Unicode and
>  numbers
. replace college = ustrregexra(college, "[^\x20-\x7E]", "") if !missing(college)
(22 real changes made)

. replace college = regexr(college, "[^a-zA-Z \-\'\.]", "") if !missing(college)
(93 real changes made)

. replace college = regexr(college, " +", " ") if !missing(college)
(6 real changes made)

. replace college = trim(college) if !missing(college)
(167 real changes made)

. replace college = regexr(college, "^[\.\-]+|[\.\-]+$", "") if !missing(college)
(50 real changes made)

. 
. * destring all numeric variables
. 
. loc numeric_vars year_first_opening professors_men professors_women students_men
>  students_women first_degrees_men first_degrees_women graduate_degrees_men gradu
> ate_degrees_women honorary_degrees

. 
. foreach variable of local numeric_vars {
  2.     replace `variable' = subinstr(`variable', ",", "", .) if !missing(`variab
> le')
  3.     replace `variable' = subinstr(`variable', "$", "", .) if !missing(`variab
> le')
  4. }
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(82 real changes made)
(0 real changes made)
(57 real changes made)
(1 real change made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. *check to ensure missing county are close to that of the original string variabl
> es. Additional missings are typically the result of textract errors.
. 
. drop is_college

. destring year_first_opening, replace 
year_first_opening: all characters numeric; replaced as int
(3571 missing values generated)

. destring professors_men, replace force 
professors_men: contains nonnumeric characters; replaced as double
(1031 missing values generated)

. destring professors_women, replace force
professors_women: contains nonnumeric characters; replaced as int
(1040 missing values generated)

. destring students_men, replace force
students_men: contains nonnumeric characters; replaced as int
(106 missing values generated)

. destring students_women, replace force
students_women: contains nonnumeric characters; replaced as double
(169 missing values generated)

. destring first_degrees_men, replace force
first_degrees_men: contains nonnumeric characters; replaced as int
(2236 missing values generated)

. destring first_degrees_women, replace force
first_degrees_women: contains nonnumeric characters; replaced as int
(2256 missing values generated)

. destring graduate_degrees_men, replace force
graduate_degrees_men: contains nonnumeric characters; replaced as double
(3632 missing values generated)

. destring graduate_degrees_women, replace force
graduate_degrees_women: contains nonnumeric characters; replaced as int
(3634 missing values generated)

. destring honorary_degrees, replace force
honorary_degrees: all characters numeric; replaced as byte
(3967 missing values generated)

. 
. compress 
  variable state was str24 now str14
  variable for_men_women was str47 now str5
  variable control was str34 now str9
  variable town was strL now str21
  (444,219 bytes saved)

. 
. export delimited "data/cleaned_scans/bi_survey1916_1918.csv", replace
file data/cleaned_scans/bi_survey1916_1918.csv saved

. 
. 
end of do-file
